#define _CRT_SECURE_NO_DEPRECATE
#include<stdio.h>
#include<math.h>

//题目含义：越往右元素越大，越往下元素越大，只需要将数组元素升序排序即可


int main() {
	int a[10][10] = {
		-36,32,-30,-18,-1,27,37,-2,3,12,8,22,-17,2,24,49,-41,-39,27,50,-16,-14,25,-25,-47,24,25,34,-4,-8,29,27,-1,25,24,-35,15,-19,-24,36,-10,-49,-2,-33,7,-40,35,17,15,-22,26,-1,27,49,-21,-41,46,-43,-3,-29,17,19,29,45,6,-5,-12,-18,-34,34,-27,16,23,-28,8,-1,33,23,-22,-3,-34,-11,-47,-48,-39,41,-5,37,27,-14,23,-34,-26,-46,-3,-19,-40,50,-31,6
	};
	for (int i = 0; i < 99; i++) {//因数组元素连续存储，固可以直接按一位数组访问
		for (int j = i+1; j < 100; j++) {//对二维数组进行冒泡排序
			if (a[0][i] > a[0][j]) {
				int tmp = a[0][i];
				a[0][i] = a[0][j];
				a[0][j] = tmp;
			}
		}
	}
	for (int i = 0; i < 10; i++) {//输出排序后数组
		for (int j = 0; j < 10; j++) {
			printf("%3d ", a[i][j]);
		}
		printf("\n");
	}

}